CSI API ETABS v1
cPropLink.GetTCFrictionIsolator Method
 Retrieves link property data for a T/C friction isolator-type link property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTCFrictionIsolator(
	string Name,
	ref bool[] DOF,
	ref bool[] Fixed,
	ref bool[] Nonlinear,
	ref double[] Ke,
	ref double[] Ce,
	ref double[] K,
	ref double[] Slow,
	ref double[] Fast,
	ref double[] Rate,
	ref double[] Radius,
	ref double[] SlowT,
	ref double[] FastT,
	ref double[] RateT,
	ref double Kt,
	ref double Dis,
	ref double Dist,
	ref double Damping,
	ref double DJ2,
	ref double DJ3,
	ref string Notes,
	ref string GUID
)
Function GetTCFrictionIsolator (
	Name As String,
	ByRef DOF As Boolean(),
	ByRef Fixed As Boolean(),
	ByRef Nonlinear As Boolean(),
	ByRef Ke As Double(),
	ByRef Ce As Double(),
	ByRef K As Double(),
	ByRef Slow As Double(),
	ByRef Fast As Double(),
	ByRef Rate As Double(),
	ByRef Radius As Double(),
	ByRef SlowT As Double(),
	ByRef FastT As Double(),
	ByRef RateT As Double(),
	ByRef Kt As Double,
	ByRef Dis As Double,
	ByRef Dist As Double,
	ByRef Damping As Double,
	ByRef DJ2 As Double,
	ByRef DJ3 As Double,
	ByRef Notes As String,
	ByRef GUID As String
) As Integer
Dim instance As cPropLink
Dim Name As String
Dim DOF As Boolean()
Dim Fixed As Boolean()
Dim Nonlinear As Boolean()
Dim Ke As Double()
Dim Ce As Double()
Dim K As Double()
Dim Slow As Double()
Dim Fast As Double()
Dim Rate As Double()
Dim Radius As Double()
Dim SlowT As Double()
Dim FastT As Double()
Dim RateT As Double()
Dim Kt As Double
Dim Dis As Double
Dim Dist As Double
Dim Damping As Double
Dim DJ2 As Double
Dim DJ3 As Double
Dim Notes As String
Dim GUID As String
Dim returnValue As Integer
returnValue = instance.GetTCFrictionIsolator(Name,
	DOF, Fixed, Nonlinear, Ke, Ce, K, Slow,
	Fast, Rate, Radius, SlowT, FastT, RateT,
	Kt, Dis, Dist, Damping, DJ2, DJ3, Notes,
	GUID)
int GetTCFrictionIsolator(
	String^ Name,
	array<bool>^% DOF,
	array<bool>^% Fixed,
	array<bool>^% Nonlinear,
	array<double>^% Ke,
	array<double>^% Ce,
	array<double>^% K,
	array<double>^% Slow,
	array<double>^% Fast,
	array<double>^% Rate,
	array<double>^% Radius,
	array<double>^% SlowT,
	array<double>^% FastT,
	array<double>^% RateT,
	double% Kt,
	double% Dis,
	double% Dist,
	double% Damping,
	double% DJ2,
	double% DJ3,
	String^% Notes,
	String^% GUID
)
abstract GetTCFrictionIsolator :
        Name : string *
        DOF : bool[] byref *
        Fixed : bool[] byref *
        Nonlinear : bool[] byref *
        Ke : float[] byref *
        Ce : float[] byref *
        K : float[] byref *
        Slow : float[] byref *
        Fast : float[] byref *
        Rate : float[] byref *
        Radius : float[] byref *
        SlowT : float[] byref *
        FastT : float[] byref *
        RateT : float[] byref *
        Kt : float byref *
        Dis : float byref *
        Dist : float byref *
        Damping : float byref *
        DJ2 : float byref *
        DJ3 : float byref *
        Notes : string byref *
        GUID : string byref -> int
Parameters
Name
Type: System.String
The name of an existing T/C friction isolator-type link property.
DOF
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if properties exist for a specified degree of freedom.
Value | DOF
DOF(0) | U1
DOF(1) | U2
DOF(2) | U3
DOF(3) | R1
DOF(4) | R2
DOF(5) | R3
Fixed
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if the specified degree of freedom is fixed (restrained).
Value | Fixity
Fixed(0) | U1 fixity if DOF(0) = True
Fixed(1) | U2 fixity if DOF(1) = True
Fixed(2) | U3 fixity if DOF(2) = True
Fixed(3) | R1 fixity if DOF(3) = True
Fixed(4) | R2 fixity if DOF(4) = True
Fixed(5) | R3 fixity if DOF(5) = True
Nonlinear
Type: System.Boolean[]
This is a boolean array, dimensioned to 5, indicating if nonlinear properties exist for a specified degree of freedom.
Value | Nonlinear
Nonlinear(0) | U1 has nonlinear properties
Nonlinear(1) | U2 has nonlinear properties
Nonlinear(2) | U3 has nonlinear properties
Nonlinear(3) | R1, not used
Nonlinear(4) | R2, not used
Nonlinear(5) | R3, not used
Note that this item is applicable only for degrees of freedom U1, U2 and U3. For those degrees of freedom, the term Nonlinear(n) applies only when DOF(n) = True and Fixed(n) = False.
Ke
Type: System.Double[]
This is an array of effective stiffness terms for the link property. The effective stiffness applies for linear analyses.
Value | Stiffness
Ke(0) | U1 [F/L]
Ke(1) | U2 [F/L]
Ke(2) | U3 [F/L]
Ke(3) | R1 [FL]
Ke(4) | R2 [FL]
Ke(5) | R3 [FL]
The term ke(n) applies only when DOF(n) = True and Fixed(n) = False.
Ce
Type: System.Double[]
This is an array of effective damping terms for the link property. The effective stiffness applies for linear analyses.
Value | Damping
Ce(0) | U1 [F/L]
Ce(1) | U2 [F/L]
Ce(2) | U3 [F/L]
Ce(3) | R1 [FL]
Ce(4) | R2 [FL]
Ce(5) | R3 [FL]
The term ce(n) applies only when DOF(n) = True and Fixed(n) = False.
K
Type: System.Double[]
This is an array of initial stiffness terms for the link property. The initial stiffness applies for nonlinear analyses.
Value | Stiffness
K(0) | U1 [F/L]
K(1) | U2 [F/L]
K(2) | U3 [F/L]
K(3) | R1, not used
K(4) | R2, not used
K(5) | R3, not used
Note that this item is applicable only for degrees of freedom U1, U2 and U3. For those degrees of freedom, the term k(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
Slow
Type: System.Double[]
This is an array of the friction coefficient at zero velocity terms when U1 is in compression for the link property. This coefficient applies for nonlinear analyses.
Value | Slow
Slow(0) | U1, not used
Slow(1) | U2
Slow(2) | U3
Slow(3) | R1, not used
Slow(4) | R2, not used
Slow(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term Slow(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
Fast
Type: System.Double[]
This is an array of the friction coefficient at fast velocity terms when U1 is in compression for the link property. This coefficient applies for nonlinear analyses.
Value | Fast
Fast(0) | U1, not used
Fast(1) | U2
Fast(2) | U3
Fast(3) | R1, not used
Fast(4) | R2, not used
Fast(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term Fast(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
Rate
Type: System.Double[]
This is an array of the inverse of the characteristic sliding velocity terms when U1 is in compression for the link property. This item applies for nonlinear analyses.
Value | Rate
Rate(0) | U1, not used
Rate(1) | U2 [s/L]
Rate(2) | U3 [s/L]
Rate(3) | R1, not used
Rate(4) | R2, not used
Rate(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term Fast(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
Radius
Type: System.Double[]
This is an array of the radius of the sliding contact surface terms for the link property. Inputting 0 means there is an infinite radius, that is, the slider is flat. This item applies for nonlinear analyses.
Value | Radius
Radius(0) | U1, not used
Radius(1) | U2 [L]
Radius(2) | U3 [L]
Radius(3) | R1, not used
Radius(4) | R2, not used
Radius(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term Fast(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
SlowT
Type: System.Double[]
This is an array of the friction coefficient at zero velocity terms when U1 is in tesion for the link property. This coefficient applies for nonlinear analyses.
Value | Slow
SlowT(0) | U1, not used
SlowT(1) | U2
SlowT(2) | U3
SlowT(3) | R1, not used
SlowT(4) | R2, not used
SlowT(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term SlowT(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
FastT
Type: System.Double[]
This is an array of the friction coefficient at fast velocity terms when U1 is in tesion for the link property. This coefficient applies for nonlinear analyses.
Value | Fast
FastT(0) | U1, not used
FastT(1) | U2
FastT(2) | U3
FastT(3) | R1, not used
FastT(4) | R2, not used
FastT(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term FastT(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
RateT
Type: System.Double[]
This is an array of the inverse of the characteristic sliding velocity terms when U1 is in tesion for the link property. This item applies for nonlinear analyses.
Value | Rate
RateT(0) | U1, not used
RateT(1) | U2 [s/L]
RateT(2) | U3 [s/L]
RateT(3) | R1, not used
RateT(4) | R2, not used
RateT(5) | R3, not used
Note that this item is applicable only for degrees of freedom U2 and U3. For those degrees of freedom, the term RateT(n) applies only when DOF(n) = True, Fixed(n) = False, and Nonlinear(n) = True.
Kt
Type: System.Double
The axial translational tension stiffness for the U1 degree of freedom. This item applies for nonlinear analyses. [F/L]
Dis
Type: System.Double
The U1 degree of freedom gap opening for compression. This item applies for nonlinear analyses. [L]
Dist
Type: System.Double
The U1 degree of freedom gap opening for tension. This item applies for nonlinear analyses. [L]
Damping
Type: System.Double
This is the nonlinear damping coefficient used for the axial translational degree of freedom, U1. This item applies for nonlinear analyses. [F/L]
DJ2
Type: System.Double
The distance from the J-End of the link to the U2 shear spring. This item applies only when DOF(1) = True. [L]
DJ3
Type: System.Double
The distance from the J-End of the link to the U3 shear spring. This item applies only when DOF(2) = True. [L]
Notes
Type: System.String
The notes, if any, assigned to the property.
GUID
Type: System.String
The GUID (global unique identifier), if any, assigned to the property.
Return Value
Type: Int32
Returns zero if the property is successfully retrieved; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
       Dim MyDOF() As Boolean
       Dim MyFixed() As Boolean
       Dim MyNonLinear() as Boolean
       Dim MyKe() As Double
       Dim MyCe() As Double
       Dim MyK() As Double
       Dim MySlow() As Double
       Dim MyFast() As Double
       Dim MyRate() As Double
       Dim MyRadius() As Double
       Dim MySlowT() As Double
       Dim MyFastT() As Double
       Dim MyRateT() As Double
       Dim DOF() As Boolean
       Dim Fixed() As Boolean
       Dim NonLinear() as Boolean
       Dim Ke() As Double
       Dim Ce() As Double
       Dim K() As Double
       Dim Slow() As Double
       Dim Fast() As Double
       Dim Rate() As Double
       Dim Radius() As Double
       Dim SlowT() As Double
       Dim FastT() As Double
       Dim RateT() As Double
       Dim kt As Double
       Dim dis As Double
       Dim dist As Double
       Dim Damping As Double
       Dim dj2 As Double
       Dim dj3 As Double
       Dim Notes As String
       Dim GUID As String
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'add link property
       ReDim MyDOF(5)
       ReDim MyFixed(5)
       ReDim MyNonLinear(5)
       ReDim MyKe(5)
       ReDim MyCe(5)
       ReDim MyK(5)
       ReDim MySlow(5)
       ReDim MyFast(5)
       ReDim MyRate(5)
       ReDim MyRadius(5)
       ReDim MySlowT(5)
       ReDim MyFastT(5)
       ReDim MyRateT(5)
       MyDOF(0) = True
       MyNonLinear(0) = True
       MyKe(0) = 12
       MyCe(0) = 0.01
       MyK(0) = 1000
       MyDOF(1) = True
       MyNonLinear(1) = True
       MyKe(1) = 12
       MyCe(1) = 0.01
       MyK(1) = 20
       MySlow(1)= 0.6
       MyFast(1)= 0.5
       MyRate(1)= 10
       MyRadius(1)= 80
       MySlowT(1)= 0.61
       MyFastT(1)= 0.51
       MyRateT(1)= 10.1
       MyDOF(2) = True
       MyNonLinear(2) = True
       MyKe(2) = 14
       MyCe(2) = 0.008
       MyK(2) = 22
       MySlow(2)= 0.66
       MyFast(2)= 0.55
       MyRate(2)= 12
       MyRadius(2)= 75
       MySlowT(2)= 0.67
       MyFastT(2)= 0.56
       MyRateT(2)= 12.1
       MyDOF(3) = True
       MyKe(3) = 15
       MyCe(3) = 0
       MyDOF(4) = True
       MyFixed(4) = True
       ret = SapModel.PropLink.SetTCFrictionIsolator("TCFI1", MyDOF, MyFixed, MyNonLinear, MyKe, MyCe, MyK, MySlow, MyFast, MyRate, MyRadius, MySlowT, MyFastT, MyRateT, 18, 2, 3, 0.1, 2, 3)
   'get link property data
       ret = SapModel.PropLink.GetTCFrictionIsolator("TCFI1", DOF, Fixed, NonLinear, Ke, Ce, k, Slow, Fast, Rate, Radius, SlowT, FastT, RateT, kt, dis, dist, Damping, dj2, dj3, Notes, GUID)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropLink Interface
ETABSv1 Namespace